---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeVertexTurn
source: html/a59971ec-c31f-a05e-e2d7-65882e23a21f.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeVertexTurn

Specify whether a bend at a RebarShapeVertex represents a left or right turn.

## Syntax (C#)
```csharp
public enum RebarShapeVertexTurn
```